#include <bits/stdc++.h>
using namespace std;

int g[10][5][3] = {
    {0, 1, 0, 
     1, 0, 1, 
     0, 0, 0, 
     1, 0, 1, 
     0, 1, 0}, //0
    {0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0}, //1
    {0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0}, //2
    {0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0}, //3
    {0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0}, //4
    {0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0}, //5
    {0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0}, //6
    {0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0}, //7
    {0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0}, //8
    {0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0}, //9
};

int main()
{
    string n;
    int s;
    while (cin >> s >> n)
    {
        if (s == 0) break;
        for (int i = 0; i < 5; i++)
        {
            if (i % 2 == 1) // 打印 | 
            {
                for (int l = 0; l < s; l++)
                {
                    for (int j = 0; j < n.size(); j++)
                    {
                        if (g[n[j] - '0'][i][0] == 1) cout << "|";
                        else cout << " ";
                        for (int k = 0; k < s; k++) cout << " ";
                        if (g[n[j] - '0'][i][2] == 1) cout << "|";
                        else cout << " ";
                        // 數字間的空格(最後一個數字後不可以再多空一格)
                        if (j != n.size() - 1) cout << " ";    
                    }
                    cout << endl;
                }
            }
            else    // 打印 - 
            {
                for (int j = 0; j < n.size(); j++)
                {
                    cout << " ";
                    for (int k = 0; k < s; k++)
                    {
                        if (g[n[j] - '0'][i][1] == 1) cout << "-";
                        else cout << " ";
                    }
                    cout << " ";
                    // 數字間的空格(最後一個數字後不可以再多空一格)
                    if (j != n.size() - 1) cout << " ";    
                }
                cout << endl;
            }
        }
        cout << endl;
    }

    return 0;
}